<template>
  <div class="container">
    <div
      :class="['contents', `mod-${routeName}`, { 'is-loaded': isLoaded }]"
      id="contents"
    >
      <main class="main">
        <nuxt />
      </main>
      <LayoutFooter />
    </div>
    <div class="loading" v-if="!isLoaded">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 364 68">
        <path
          d="M29.4 21.14c-1.92 5-4.84 10.8-8.28 14.32a36.11 36.11 0 00-4.32-2.8c3.32-3.16 6-8.56 7.28-12.76zm19.36 12c-3.92 12.32-11.88 17-26.32 19.24a16.48 16.48 0 00-2.52-4.76c13.24-1.48 20.48-5.28 23.72-16zM38 14.9v19.4c0 2.52-.48 3.88-2.2 4.6s-4.16.92-7.4.92a17.93 17.93 0 00-1.68-4.92c2.28.08 4.76.08 5.48 0s1-.16 1-.72V14.9zm8.2 4.4c3.24 4 6.92 9.32 8.32 13.16l-4.88 2.6c-1.2-3.68-4.6-9.28-7.88-13.48zM90.16 26.26a69.16 69.16 0 01-8.08 15.36 31.32 31.32 0 014.76 3.68l-3.32 4.56c-3-3.2-9.64-7.36-15.08-9.88l3-4c2 .84 4.12 1.88 6.24 3a54.49 54.49 0 005.44-9.72H71.64a44.58 44.58 0 01-8.4 11.88 28.84 28.84 0 00-4.6-2.68c6-5.32 10.36-14.4 12.36-21.64L76.32 18c-.72 2.12-1.52 4.28-2.48 6.48H85.6l.88-.2zM111.28 32.38a32.24 32.24 0 017.6-1c6.08 0 10.88 3.24 10.88 8.68 0 4.68-2.44 8.2-8.72 9.76a32.27 32.27 0 01-5.2.64L114 45.34a30.28 30.28 0 004.88-.28c3.2-.56 5.76-2.2 5.76-5.08 0-2.68-2.4-4.24-5.84-4.24a28.12 28.12 0 00-7.44 1.08c.08 3.16.2 6.2.2 7.56 0 4.92-1.8 6.2-4.36 6.2-3.88 0-9.36-3.32-9.36-7.52 0-3.48 4-7 8.88-9.16v-6.08c-.76 0-1.48.08-2.12.08-1.8 0-3.8 0-5.52-.2L99 22.9a43.4 43.4 0 005.48.32c.72 0 1.48 0 2.28-.08V19.9a31.44 31.44 0 00-.28-3.48h5.44c-.08.72-.24 2.44-.32 3.44s-.08 1.84-.12 2.84a54.25 54.25 0 007.28-1.48l.12 5a76.5 76.5 0 01-7.56 1.24v3.56zm-4.36 11.12c0-1 0-2.8-.12-4.88-2.44 1.24-4 2.88-4 4.28 0 1.2 1.84 2.32 2.88 2.32.68 0 1.24-.36 1.24-1.72zm16.32-22.8a87.5 87.5 0 019.76 5.56l-2.4 4.08a60.17 60.17 0 00-9.6-5.76zM167.36 31.58v3.16h4.72v4.32h-4.72v8.16c0 2.4-.44 3.56-2 4.28s-3.8.76-6.8.76a19 19 0 00-1.56-4.48c2 .08 4.16.08 4.8 0s.8-.12.8-.68v-8.04h-15.44v-4.32h15.48v-3.16h-15.88v-3.76c-.6.84-1.2 1.68-1.88 2.56v21.84h-4.56v-16.6a44.14 44.14 0 01-3.64 3.28 32.74 32.74 0 00-2.2-4.92 35.77 35.77 0 009.6-10.28l4.16 1.8c-.36.56-.72 1.16-1.12 1.76h10.08v-3.48H149v-4.32h8.2V15.1h4.72v4.36h8.6v4.32h-8.6v3.48h10.52v4.32zM147.6 16.82a41.83 41.83 0 01-10.4 10 27.9 27.9 0 00-2.36-4 27.13 27.13 0 008.24-7.8zm5.68 22.48a30.52 30.52 0 014.72 6.8l-4.16 2.24a30.8 30.8 0 00-4.4-7zM203 25.18c-4.12.64-10.4 1.4-15.72 1.68a69.9 69.9 0 01-1.8 6.84 19.26 19.26 0 019.84-2.48c6.4 0 10.64 3.44 10.64 8.48 0 8.92-8.56 12.12-21.36 10.76l-1.4-5.12c8.68 1.4 17.44.36 17.44-5.48 0-2.36-2.08-4.36-5.92-4.36-4.56 0-8.6 1.64-11 4.68a11.63 11.63 0 00-1.12 1.72l-4.6-1.68a64 64 0 004.52-13.28c-2.52 0-4.84-.2-6.84-.4v-4.92a56 56 0 007.76.76c.08-.6.2-1.12.24-1.6a24.23 24.23 0 00.2-4l5.6.24a41.4 41.4 0 00-.92 4l-.24 1.2A95.3 95.3 0 00203 20.38zM234 20.06c-1.24.92-2.56 2-3.48 2.68-2.56 2.08-7.8 6.12-10.44 8.4-2.12 1.8-2.08 2.24.08 4.08 3 2.52 10.6 8.56 14.52 12.36L230 51.82c-1.12-1.24-2.36-2.48-3.48-3.68-2.16-2.28-8.2-7.44-11.84-10.52-3.92-3.32-3.6-5.52.36-8.8 3.08-2.52 8.52-6.92 11.2-9.56a27.36 27.36 0 003-3.32zM261.76 26.34a71.3 71.3 0 01-7.68 1.32c-.36 1.68-.76 3.44-1.2 5.08a129.47 129.47 0 01-6.28 18.32l-5.6-1.84c2.36-4 5.36-12.28 6.84-17.84.28-1.08.6-2.2.84-3.32-.92 0-1.8.08-2.6.08-1.92 0-3.4-.08-4.79-.16l-.12-4.92a38.13 38.13 0 005 .28c1.16 0 2.32 0 3.52-.12.16-.84.28-1.64.36-2.24a20.87 20.87 0 00.16-4l6 .48c-.28 1.12-.64 2.88-.84 3.76l-.32 1.48c2.24-.32 4.48-.76 6.64-1.28zm-.8 13a14 14 0 00-.56 3.32c0 1.72 1 3 5.24 3a49.9 49.9 0 008.24-.8l-.2 5.08a63.39 63.39 0 01-8.08.56c-6.68 0-10.08-2.32-10.08-6.32a26.4 26.4 0 01.68-5.28zm-2.32-9.92a74.62 74.62 0 017.6-.4 68.58 68.58 0 017 .32l-.12 4.8a56.75 56.75 0 00-6.8-.52 66 66 0 00-7.64.44zM269 25.34a44.79 44.79 0 00-3.12-5.56l3.16-1.32a55 55 0 013.16 5.48zm4.76-8.68A47.34 47.34 0 01277 22.1l-3.16 1.36a42.41 42.41 0 00-3.24-5.52zM308.84 25.22c-2 .56-4.32 1.12-6.72 1.6 1.52 3.2 3.4 7 5.12 10.12l-2.8 3c-2.16-.44-6.08-1.08-9-1.44l.44-4.08c1.32.12 3.48.36 4.68.44-1-2-2.32-4.76-3.48-7.24a88.89 88.89 0 01-16.67 0l-.16-5.08a67.4 67.4 0 0014.79.4c-.32-.64-.6-1.28-.84-1.88a30.75 30.75 0 00-2-3.8l5.6-1.08c.68 2.08 1.44 4 2.32 6a58 58 0 007.76-2zm-21.63 11a17.81 17.81 0 00-1.09 4.72c0 2.88 1.49 4.84 7.08 4.84a43.8 43.8 0 0010.8-1.16l-.12 5.24a55.51 55.51 0 01-10.68 1c-7.95 0-12.23-3-12.23-8.52a26.85 26.85 0 011.12-6.52zM321.4 25.1c0 2.56 0 5.56.24 8.4.56 5.72 1.76 9.6 4.24 9.6 1.88 0 3.44-4.64 4.2-7.76l4 4.8c-2.64 6.88-5.12 9.32-8.32 9.32-4.32 0-8.11-3.92-9.23-14.56-.36-3.64-.44-8.24-.44-10.68a23 23 0 00-.28-4l6.07.08a31.39 31.39 0 00-.48 4.8zm27.52 16.28l-5.24 2c-.6-6.36-2.72-15.68-7-20.56l5-1.68c3.76 4.6 6.8 14.16 7.24 20.24z"
        />
        <path
          fill="none"
          stroke="#000"
          stroke-miterlimit="10"
          stroke-width="5"
          d="M2 2h360v64H2z"
        />
      </svg>
    </div>
  </div>
</template>

<script>
import LayoutFooter from './LayoutFooter'

let WebFont

if (process.browser) {
  WebFont = require('webfontloader')
}

const MIN_WAIT_MS = 500
const MAX_WAIT_MS = 5000

export default {
  components: { LayoutFooter },
  data() {
    return {
      isLoaded: false
    }
  },
  computed: {
    routeName() {
      return this.$route.name
    }
  },
  async mounted() {
    /**
     * フォント読み込み時にバキッとなるのが嫌なので読み込みを待つ
     */
    await Promise.race([
      Promise.all([this.loadFonts(), this.waitMs(MIN_WAIT_MS)]),
      this.waitMs(MAX_WAIT_MS)
    ])

    this.isLoaded = true
  },
  methods: {
    loadFonts() {
      return new Promise(resolve => {
        WebFont.load({
          custom: {
            families: ['Noto Sans JP', 'Lato'],
            urls: [
              '/css/noto-sans.css',
              'https://fonts.googleapis.com/css?family=Lato:700'
            ]
          },
          active: () => resolve(),
          inactive: () => resolve()
        })
      })
    },
    waitMs(ms) {
      return new Promise(resolve => {
        setTimeout(() => resolve(), ms)
      })
    }
  }
}
</script>

<style lang="scss">
*,
*:before,
*:after {
  box-sizing: border-box;
  margin: 0;
  padding: 0;
}

* {
  -webkit-tap-highlight-color: rgba($color-black, 0.5);
}

h1,
h2,
h3,
h4,
h5,
h6 {
  font-size: 100%;
  font-weight: inherit;
}

a {
  color: inherit;
  text-decoration: none;
}

li {
  list-style: none;
}

input,
textarea,
select,
button {
  background: none;
  box-shadow: none;
  border: 0;
  border-radius: 0;
  outline: none;
  color: inherit;
  font-size: inherit;
  font-family: inherit;
  font-weight: inherit;
  -webkit-appearance: none;
  -moz-appearance: none;
  appearance: none;
  cursor: pointer;
}

html {
  font-size: 2vw;
  @include min {
    font-size: 16px;
  }
}

body {
  color: $color-font;
  text-align: center;
  line-height: 1.7;
  letter-spacing: 0.1em;
  font-family: 'Noto Sans JP', sans-serif;
  font-weight: 700;
  background-color: $color-snow;
}

.container {
  max-width: $mq-max;
  margin: 0 auto;
  padding-top: 6rem;
  background-color: $color-white;
}

.contents {
  visibility: hidden;
  &.is-loaded {
    visibility: visible;
  }
}

.loading {
  width: 22.75rem;
  height: 4.25rem;
  position: fixed;
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
  margin: auto;
  svg {
    width: 100%;
    height: 100%;
    display: block;
    fill: $color-fill;
  }
}

.fade {
  &-enter-active,
  &-leave-active {
    transition: opacity 0.1s linear;
  }
  &-enter,
  &-leave-to {
    opacity: 0;
  }
}
</style>
